# Fallback Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedShapeBuilder..::..Fallback Property
TessellatedShapeBuilder Class See Also
---
Defines acceptable fallback if the desired type of geometry can't be built.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public TessellatedShapeBuilderFallback Fallback { get; set; }
```

Visual Basic
---
```text
Public Property Fallback As TessellatedShapeBuilderFallback
	Get
	Set
```

Visual C++
---
```text
public:
property TessellatedShapeBuilderFallback Fallback {
	TessellatedShapeBuilderFallback get ();
	void set (TessellatedShapeBuilderFallback value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace